app/controllers/orders_controller.rb

  def index
    u = current_user
    @user = u
    if ( u and u.admin? )
      @orders = Order.all
---
SELECT "orders".* FROM "orders"

  def my_orders
    @user = current_user
    if ( @user )
      @orders = @user.orders
---
SELECT "orders".* FROM "orders" WHERE "orders"."user_id" = ?  [["user_id", 1]]

  def edit
    @user = current_user
    u = @user
    if ( u.admin? )
      o = u.orders.find_by_id( params[ :id ] )
---
SELECT "orders".* FROM "orders" WHERE "orders"."user_id" = ? AND "orders"."id" = 1 LIMIT 1  [["user_id", 1]]

  def create
    #@order = Order.new(order_params)
    u = current_user
    @user = u
    if ( u )
      @order = u.orders.new
      o = @order
      o.desc = params[ :desc ]
      o.attachment = params[ :file ]
      if ( o.save )
---
INSERT INTO "orders" ("created_at", "desc", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", Sun, 19 Jan 2014 05:52:52 UTC +00:00], ["desc", "<p>This is a new order</p>"], ["updated_at", Sun, 19 Jan 2014 05:52:52 UTC +00:00], ["user_id", 1]]

  def update
    #debugger
    u = current_user
    @user = u
    if ( u.admin? )
      o = u.orders.find_by_id( params[ :id ][ :id ] )
---
SELECT "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT 1  [["id", "{:value=>1}"]]