app/controllers/static_pages_controller.rb

INSERT INTO "images" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", Fri, 27 Dec 2013 06:16:43 UTC +00:00], ["updated_at", Fri, 27 Dec 2013 06:16:43 UTC +00:00]]
---
  def submitImage
    #debugger;
    image = Image.new()
    image.avatar = params[ :avatar ]
    if ( image.save! )

SELECT "users".* FROM "users" WHERE "users"."email" = 'a@a.b' LIMIT 1
---
  def user_sign_in
    email    = params[ :email ]
    password = params[ :password ]
    #debugger
    user = User.find_by_email( email )

INSERT INTO "users" ("avatar_content_type", "avatar_file_name", "avatar_file_size", "avatar_updated_at", "created_at", "name", "password_digest", "remember_token", "surname", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def user_register
    #if simple_captcha_valid?
    u = User.new
    u.email                 = params[ :email ]
    u.name                  = params[ :name ]
    u.surname               = params[ :surname ]
    u.password              = params[ :password ]
    u.password_confirmation = params[ :password_confirmation ]
    u.avatar                = params[ :avatar ]
    u.admin                 = ( current_user && current_user.admin? ) ? (params[ :admin ] || false) : false

    #debugger
    current_user = u
    @user        = u
    #end
    if ( u && u.save )