app/controllers/users_controller.rb

  def all
    #if ( current_user && current_user.admin? )
    #  @users = User.all
    #else
    #  @users = nil
    #end
      #puts '#########################################'
      #puts 'here!'
      #puts @user
      #puts '+++++++++++++++++++++++++++++++++++++++++'

    @users = User.all
---
SELECT "users".* FROM "users"

  def edit
    @user = User.find_by_id( params[ :id ] )
---
SELECT "users".* FROM "users" WHERE "users"."id" = 3 LIMIT 1